JonSche/grohe_blue_dial/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# VIEWE UEDX24240013-MD50E-B ships 4MB flash, no PSRAM (confirmed against
# the real hardware via `esptool flash_id`, not just this Kconfig value --
# see docs/ARCHITECTURE.md's "Flash layout" section for the full review).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# M9 (Wi-Fi/SNTP) alone added ~448KB to the app image, leaving the
# previous single 1.5MB `factory` partition (partitions_singleapp_large.csv)
# at 2% free -- and a single-slot layout can't be safely OTA-updated later
# anyway (a failed write would overwrite the only running image). Custom
# partitions.csv: two 1984K ota_0/ota_1 slots instead, so OTA (an explicit
# product-roadmap item) never needs a second, disruptive partition
# migration once it's actually implemented -- see partitions.csv's own
# comment for the exact sizing.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Modern C++ support.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

# LVGL: GC9A01 is a 16bpp (RGB565) panel.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_28=y
# Large centered pour-amount readout on the M2 dial screen.
CONFIG_LV_FONT_MONTSERRAT_48=y

# A bit more headroom than the 3.5k default main task stack, since our app
# orchestration (display/encoder/UI/BLE init, all called from app_main)
# grows it a little.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# BLE (M3.1): NimBLE only -- this chip has no classic Bluetooth radio, and
# NimBLE's own footprint is meaningfully smaller than Bluedroid's for a
# BLE-only, single-peripheral product (see the M3 architecture review).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# This firmware only ever talks to one peripheral (the Grohe Blue).
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1

# OTA (M12.4): a freshly-flashed OTA image boots in ESP_OTA_IMG_PENDING_
# VERIFY state; if it crashes, watchdogs, or loses power before
# ota::OtaManager::Init() confirms it (see app.cpp), the bootloader
# automatically reverts to the previous working image on the next boot.
# Not anti-rollback (no monotonic security-version enforcement, no
# downgrade prevention) -- just the base "a bad update can't brick the
# dial" guarantee. See CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE's own
# Kconfig help text.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
